### UNIVERSIDAD GALILEO<br> Statistical Learning I<br>  Luis Florian, 0710082
El proyecto consiste en hacer clasificación binaria  para determinar si una persona sobrevive(y=1) o no (y=0) del hundimiento del Titanic .

In [13]:
import pandas as pd
import numpy as np
import tensorflow as tf
import datetime
import matplotlib.pyplot as plt
import seaborn as sns
import graphviz
from sklearn.model_selection import train_test_split
from sklearn.tree import export_graphviz, DecisionTreeClassifier
import pandas as pd
from sklearn import svm
from math import sqrt, pi, exp
from sklearn.metrics import accuracy_score, f1_score, recall_score, precision_score
from sklearn.utils import resample

#TensorFlow version 1 compatibility
sns.set(style="darkgrid")
if tf.__version__.startswith("2."):
  import tensorflow.compat.v1 as tf
  tf.compat.v1.disable_v2_behavior()
  tf.compat.v1.disable_eager_execution()

WARNING:tensorflow:From /home/jarminet/anaconda3/envs/galileo1/lib/python3.7/site-packages/tensorflow/python/compat/v2_compat.py:96: disable_resource_variables (from tensorflow.python.ops.variable_scope) is deprecated and will be removed in a future version.
Instructions for updating:
non-resource variables are not supported in the long term

### **Carga de datos**

In [22]:
data = pd.read_csv('./data/data_titanic_proyecto.csv')
# Cada vez que se vuelvan a cargar los datos, necesitaremos volver a transformar
transformed_categoric = False

### **Análisis Exploratorio de Datos**

In [23]:
data.isna().sum()

PassengerId             0
Name                    0
Age                   177
SibSp                   0
Parch                   0
Ticket                  0
Fare                    0
Cabin                 687
Embarked                2
passenger_class         0
passenger_sex           0
passenger_survived      0
dtype: int64

Se observa que Cabin tiene muchos valores faltantes, por lo que no es recomendable realizar imputación de media/mediana.  Meintras que si podemos utilizar estadística descriptiva para rellenar los valores faltantes en Age y Embarked ya que son menos faltantes.

In [24]:
data.sample(5)

,PassengerId,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,passenger_class,passenger_sex,passenger_survived
788,789,"Dean, Master. Bertram Vere",1.0,1,2,C.A. 2315,20.5750,NaN,S,Lower,M,Y
337,338,"Burns, Miss. Elizabeth Margaret",41.0,0,0,16966,134.5000,E40,C,Upper,F,Y
797,798,"Osman, Mrs. Mara",31.0,0,0,349244,8.6833,NaN,S,Lower,F,Y
43,44,"Laroche, Miss. Simonne Marie Anne Andree",3.0,1,2,SC/Paris 2123,41.5792,NaN,C,Middle,F,Y
341,342,"Fortune, Miss. Alice Elizabeth",24.0,3,2,19950,263.0000,C23 C25 C27,S,Upper,F,Y

Se observa que tenemos varias variables categóricas.

### **Transformación de Variables Categóricas**

In [25]:
if not transformed_categoric:
    data["passenger_class"] = data["passenger_class"].replace({"Upper" : 1, "Middle" : 2, "Lower" : 3}).astype('int32')
    data["passenger_survived"] = data["passenger_survived"].replace({"Y" : 1, "N" : 0}).astype('int32')
    data["passenger_sex"] = data["passenger_sex"].replace({"M" : 1, "F" : 0}).astype('int32')
    data["Embarked"] = data["Embarked"].replace({"Q" : 0, "C" : 1, "S": 2})
    transformed_categoric = True

In [26]:
data.sample(5)

,PassengerId,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,passenger_class,passenger_sex,passenger_survived
289,290,"Connolly, Miss. Kate",22.0,0,0,370373,7.7500,NaN,0.0,3,0,1
747,748,"Sinkkonen, Miss. Anna",30.0,0,0,250648,13.0000,NaN,2.0,2,0,1
38,39,"Vander Planke, Miss. Augusta Maria",18.0,2,0,345764,18.0000,NaN,2.0,3,0,0
452,453,"Foreman, Mr. Benjamin Laventall",30.0,0,0,113051,27.7500,C111,1.0,1,1,0
561,562,"Sivic, Mr. Husein",40.0,0,0,349251,7.8958,NaN,2.0,3,1,0

Se observa que los valores en las variables categóricas tiene ahora una representación numérica.

### **Splitting Data Set**
Vamos a separar el dataset en tres grupos, training, testing y validation.

In [27]:
train = test = validation = None
def split_dataset():
    global train, test, validation
    train, test = train_test_split(data, test_size=0.2, random_state=420*666)
    train, validation = train_test_split(train, test_size=0.2, random_state=420*666)

split_dataset()

print("Complete data shape =", data.shape)
print("train shape shape =", train.shape)
print("validation shape", validation.shape)

Complete data shape = (891, 12)
train shape shape = (569, 12)
validation shape (143, 12)

### **Imputación de datos faltantes**

In [32]:
print("***** Medianas *****")
print(train.groupby('passenger_class').median()['Age'], "\n")
print(train.groupby('passenger_sex').median()['Age'], "\n\n")

print("***** Medias *****")
print(train.groupby('passenger_class').mean()['Age'], "\n")
print(train.groupby('passenger_sex').mean()['Age'], "\n")

***** Medianas *****
passenger_class
1    36.0
2    30.0
3    25.0
Name: Age, dtype: float64

passenger_sex
0    27.0
1    29.0
Name: Age, dtype: float64


***** Medias *****
passenger_class
1    36.503590
2    29.708276
3    26.054330
Name: Age, dtype: float64

passenger_sex
0    28.021802
1    30.643860
Name: Age, dtype: float64

**Dos factores importantes:**

**1)** Aumento en la mediana de la edad conforme la clase aumenta.<br>
**2)** Las mujeres son ligeramente más jóvenes.